xml/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказКлиента</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

xml/InformationRegisters/Расш6270_Состояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>Расш6270_Состояние</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Булево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/Documents/ЗаказКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура Расш6270_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//Создаем Команду
	НоваяКоманда = ЭтаФорма.Команды.Добавить("Расш6270_СоздатьСделкуВБитрикс");
	НоваяКоманда.Действие = "Расш6270_СоздатьСделкуВБитрикс";
	Если ПолучитьНомерСделки(Объект.Ссылка) = Неопределено Тогда
		НоваяКоманда.Заголовок = "Отправить в Битрикс";
	Иначе
		НоваяКоманда.Заголовок = "Открыть в Битрикс";
	КонецЕсли;
	
	НоваяКнопка = ЭтаФорма.Элементы.Добавить("Расш6270_СоздатьСделкуВБитрикс", Тип("КнопкаФормы"), ЭтаФорма.Элементы.ГруппаСтатусПриоритет);
	НоваяКнопка.ИмяКоманды = "Расш6270_СоздатьСделкуВБитрикс";
	НоваяКнопка.Картинка = БиблиотекаКартинок.ОтправитьСообщение;
	НоваяКнопка.Отображение = ОтображениеКнопки.КартинкаИТекст;
КонецПроцедуры

&НаКлиенте
Процедура Расш6270_СоздатьСделкуВБитрикс(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НомерСделки = ПолучитьНомерСделки(Объект.Ссылка);
		Если НомерСделки = Неопределено Тогда
			Расш6270_Битрикс24.СоздатьСделку(Объект.Ссылка);
			ЭтаФорма.Элементы.Расш6270_СоздатьСделкуВБитрикс.Заголовок = "Открыть в Битрикс";
			
		Иначе
			ПерейтиПоНавигационнойСсылке("https://stroizakaz.bitrix24.ru/crm/deal/details/" + НомерСделки + "/");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьНомерСделки(Ссылка)
	НомерСделки = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Расш6270_Состояние.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.Расш6270_Состояние КАК Расш6270_Состояние
		|ГДЕ
		|	Расш6270_Состояние.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		НомерСделки = Выборка.Состояние;
	КонецЕсли;
	
	Возврат НомерСделки;
КонецФункции
